# coding=utf-8
from django.core.validators import validate_email
from django.core.exceptions import ValidationError
from base.user import User

# validation for account


def v_validate_email(email):
    """ 如合法返回 True """

    try:
        validate_email(email)
        return True
    except ValidationError:
        return False


def v_validate_gender(g):
    """ 如合法返回 True """

    return g == 'F' or g == 'M' or g == 'O'


def v_check_nickname(nickname, must_not_exist = False):
    """ 返回错误信息，若没问题返回 None """

    _ret = None

    if nickname is None or len(nickname) == 0:
        _ret = u'请填写昵称'
    elif len(nickname) > 15:
        _ret = u'昵称不能超过15个字'
    elif must_not_exist and User.nickname_exist(nickname):
        _ret = u'昵称已经被占用'

    return _ret


def v_check_email(email, must_not_exist = False):
    """ 返回错误信息，若没问题返回 None """

    _ret = None

    if email is None or len(email) == 0:
        _ret = u'请填写邮箱'
    elif not v_validate_email(email):
        _ret = u'请输入正确的邮箱'
    elif must_not_exist and User.email_exist(email):
        _ret = u'邮箱已经被占用'

    return _ret


def v_check_psw(psw):
    """ 返回错误信息，若没问题返回 None """

    _ret = None

    if psw is None or len(psw) == 0:
        _ret = u'请填写密码'
    elif len(psw) < 6:
        _ret = u'密码必须大于6位'

    return _ret


def v_check_bio(b):
    """ 返回错误信息，若没问题返回 None """

    _ret = None

    if b is not None and len(b) > 300:
        _ret = u'简介需在300字以内'

    return _ret


def v_check_website(w):
    """ 返回错误信息，若没问题返回 None """

    _ret = None

    if w is not None and len(w) > 255:
        _ret = u'url太长'

    return _ret


def v_validate_location(l, c):
    """ 如合法返回 True """

    _ls = [u'安徽', u'澳门', u'北京', u'福建', u'甘肃', u'广东', u'广西', u'贵州', u'海南', u'河北', u'河南', u'黑龙江', u'湖北', u'湖南', u'吉林',
           u'江苏', u'江西', u'辽宁',
           u'内蒙古', u'宁夏', u'青海', u'山东', u'山西', u'陕西', u'上海', u'四川', u'台湾', u'天津', u'西藏', u'香港', u'新疆', u'云南', u'浙江',
           u'重庆', u'海外']
    _cs = [
        [u'合肥', u'安庆', u'蚌埠', u'亳州', u'巢湖', u'池州', u'滁州', u'阜阳', u'淮北', u'淮南', u'黄山', u'六安', u'马鞍山', u'宿州', u'铜陵',
         u'芜湖', u'宣城'],
        [u'澳门'],
        [u'昌平', u'朝阳', u'崇文', u'大兴', u'东城', u'房山', u'丰台', u'海淀', u'怀柔', u'门头沟', u'密云', u'平谷', u'石景山', u'顺义', u'通州',
         u'西城', u'宣武', u'延庆'],
        [u'福州', u'龙岩', u'南平', u'宁德', u'莆田', u'泉州', u'三明', u'厦门', u'漳州'],
        [u'兰州', u'白银', u'定西', u'甘南', u'嘉峪关', u'金昌', u'酒泉', u'临夏', u'陇南', u'平凉', u'庆阳', u'天水', u'武威', u'张掖'],
        [u'广州', u'潮州', u'东莞', u'佛山', u'河源', u'惠州', u'江门', u'揭阳', u'茂名', u'梅州', u'清远', u'汕头', u'汕尾', u'韶关', u'深圳', u'阳江',
         u'云浮', u'湛江',
         u'肇庆', u'中山', u'珠海'],
        [u'桂林', u'百色', u'北海', u'崇左', u'防城港', u'贵港', u'河池', u'贺州', u'来宾', u'柳州', u'南宁', u'钦州', u'梧州', u'玉林'],
        [u'贵阳', u'安顺', u'毕节', u'六盘水', u'黔东南', u'黔南', u'黔西南', u'铜仁', u'遵义'],
        [u'海口', u'白沙', u'保亭', u'昌江', u'澄迈', u'儋州', u'定安', u'东方', u'乐东', u'临高', u'陵水', u'南沙群岛', u'琼海', u'琼中', u'三亚',
         u'屯昌', u'万宁', u'文昌',
         u'五指山', u'西沙群岛', u'中沙群岛'],
        [u'石家庄', u'保定', u'沧州', u'承德', u'邯郸', u'衡水', u'廊坊', u'秦皇岛', u'唐山', u'邢台', u'张家口'],
        [u'郑州', u'安阳', u'鹤壁', u'焦作', u'开封', u'洛阳', u'漯河', u'南阳', u'平顶山', u'濮阳', u'三门峡', u'商丘', u'新乡', u'信阳', u'许昌',
         u'周口', u'驻马店'],
        [u'哈尔滨', u'大庆', u'大兴安岭', u'鹤岗', u'黑河', u'鸡西', u'佳木斯', u'牡丹江', u'七台河', u'齐齐哈尔', u'双鸭山', u'绥化', u'伊春'],
        [u'武汉', u'鄂州', u'恩施', u'黄冈', u'黄石', u'荆门', u'荆州', u'潜江', u'神农架', u'十堰', u'随州', u'天门', u'仙桃', u'咸宁', u'襄樊',
         u'孝感', u'宜昌'],
        [u'长沙', u'常德', u'郴州', u'衡阳', u'怀化', u'娄底', u'邵阳', u'湘潭', u'湘西', u'益阳', u'永州', u'岳阳', u'张家界', u'株洲'],
        [u'长春', u'白城', u'白山', u'吉林', u'辽源', u'四平', u'松原', u'通化', u'延边'],
        [u'南京', u'常州', u'淮安', u'连云港', u'南通', u'苏州', u'宿迁', u'泰州', u'无锡', u'徐州', u'盐城', u'扬州', u'镇江'],
        [u'南昌', u'抚州', u'赣州', u'吉安', u'景德镇', u'九江', u'萍乡', u'上饶', u'新余', u'宜春', u'鹰潭'],
        [u'沈阳', u'鞍山', u'本溪', u'朝阳', u'大连', u'丹东', u'抚顺', u'阜新', u'葫芦岛', u'锦州', u'辽阳', u'盘锦', u'铁岭', u'营口'],
        [u'呼和浩特', u'阿拉善', u'巴彦淖尔', u'包头', u'赤峰', u'鄂尔多斯', u'呼伦贝尔', u'通辽', u'乌海', u'乌兰察布', u'锡林郭勒', u'兴安'],
        [u'银川', u'固原', u'石嘴山', u'吴忠', u'中卫'],
        [u'西宁', u'果洛', u'海北', u'海东', u'海南', u'海西', u'黄南', u'玉树'],
        [u'济南', u'滨州', u'德州', u'东营', u'菏泽', u'济宁', u'莱芜', u'聊城', u'临沂', u'青岛', u'日照', u'泰安', u'威海', u'潍坊', u'烟台', u'枣庄',
         u'淄博'],
        [u'太原', u'长治', u'大同', u'晋城', u'晋中', u'临汾', u'吕梁', u'朔州', u'忻州', u'阳泉', u'运城'],
        [u'西安', u'安康', u'宝鸡', u'汉中', u'商洛', u'铜川', u'渭南', u'咸阳', u'延安', u'榆林'],
        [u'宝山', u'长宁', u'崇明', u'奉贤', u'虹口', u'黄浦', u'嘉定', u'金山', u'静安', u'卢湾', u'闵行', u'南汇', u'浦东', u'普陀', u'青浦', u'松江',
         u'徐汇', u'杨浦',
         u'闸北'],
        [u'成都', u'阿坝', u'巴中', u'达州', u'德阳', u'甘孜', u'广安', u'广元', u'乐山', u'凉山', u'泸州', u'眉山', u'绵阳', u'内江', u'南充',
         u'攀枝花', u'遂宁', u'雅安',
         u'宜宾', u'资阳', u'自贡'],
        [u'台北', u'阿莲', u'安定', u'安平', u'八德', u'八里', u'白河', u'白沙', u'板桥', u'褒忠', u'宝山', u'卑南', u'北斗', u'北港', u'北门', u'北埔',
         u'北投', u'补子',
         u'布袋', u'草屯', u'长宾', u'长治', u'潮州', u'车城', u'成功', u'城中区', u'池上', u'春日', u'刺桐', u'高雄', u'花莲', u'基隆', u'嘉义',
         u'苗栗', u'南投', u'屏东',
         u'台东', u'台南', u'台中', u'桃园', u'新竹', u'宜兰', u'彰化'],
        [u'宝坻', u'北辰', u'大港', u'东丽', u'汉沽', u'和平', u'河北', u'河东', u'河西', u'红桥', u'蓟县', u'津南', u'静海', u'南开', u'宁河', u'塘沽',
         u'武清', u'西青'],
        [u'拉萨', u'阿里', u'昌都', u'林芝', u'那曲', u'日喀则', u'山南'],
        [u'北区', u'大埔区', u'东区', u'观塘区', u'黄大仙区', u'九龙', u'葵青区', u'离岛区', u'南区', u'荃湾区', u'沙田区', u'深水埗区', u'屯门区', u'湾仔区',
         u'西贡区', u'香港',
         u'新界', u'油尖旺区', u'元朗区', u'中西区'],
        [u'乌鲁木齐', u'阿克苏', u'阿拉尔', u'阿勒泰', u'巴音郭楞', u'博尔塔拉', u'昌吉', u'哈密', u'和田', u'喀什', u'克拉玛依', u'克孜勒苏柯尔克孜', u'石河子',
         u'塔城', u'图木舒克',
         u'吐鲁番', u'五家渠', u'伊犁'],
        [u'昆明', u'保山', u'楚雄', u'大理', u'德宏', u'迪庆', u'红河', u'丽江', u'临沧', u'怒江', u'曲靖', u'思茅', u'文山', u'西双版纳', u'玉溪',
         u'昭通'],
        [u'杭州', u'湖州', u'嘉兴', u'金华', u'丽水', u'宁波', u'衢州', u'绍兴', u'台州', u'温州', u'舟山'],
        [u'巴南', u'北碚', u'璧山', u'长寿', u'城口', u'大渡口', u'大足', u'垫江', u'丰都', u'奉节', u'涪陵', u'合川', u'江北', u'江津', u'九龙坡',
         u'开县', u'梁平', u'南岸',
         u'南川', u'彭水', u'綦江', u'黔江', u'荣昌', u'沙坪坝', u'石柱', u'双桥', u'铜梁', u'潼南', u'万盛', u'万州', u'巫山', u'巫溪', u'武隆',
         u'秀山', u'永川', u'酉阳',
         u'渝北', u'渝中', u'云阳', u'忠县'],
        [u'阿根廷', u'埃及', u'爱尔兰', u'奥地利', u'奥克兰', u'澳大利亚', u'巴基斯坦', u'巴西', u'保加利亚', u'比利时', u'冰岛', u'朝鲜', u'丹麦', u'德国',
         u'俄罗斯', u'法国',
         u'菲律宾', u'芬兰', u'哥伦比亚', u'韩国', u'荷兰', u'加拿大', u'柬埔寨', u'喀麦隆', u'老挝', u'卢森堡', u'罗马尼亚', u'马达加斯加', u'马来西亚',
         u'毛里求斯', u'美国', u'秘鲁',
         u'缅甸', u'墨西哥', u'南非', u'尼泊尔', u'挪威', u'葡萄牙', u'其它地区', u'日本', u'瑞典', u'瑞士', u'斯里兰卡', u'泰国', u'土耳其', u'委内瑞拉',
         u'文莱', u'乌克兰',
         u'西班牙', u'希腊', u'新加坡', u'新西兰', u'匈牙利', u'以色列', u'意大利', u'印度', u'印度尼西亚', u'英国', u'越南', u'智利']
    ]

    if l is None or c is None:
        return False

    _ret = False
    l = l.strip()
    c = c.strip()

    try:
        _i = _ls.index(l)
        if c in _cs[_i]:
            _ret = True
    except Exception:
        pass

    return _ret